# Import

In [2]:
import pandas as pd

# Load Raw Dataset

In [6]:
retail_sales = pd.read_csv("../data/raw/retail_sales_dataset.csv")

retail_sales.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [7]:
retail_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

# Convert Columns To Lowercase Snakecase Format

In [9]:
retail_sales.columns = retail_sales.columns.str.lower().str.replace(' ', '_')

retail_sales.head()

,transaction_id,date,customer_id,gender,age,product_category,quantity,price_per_unit,total_amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

# Assign Proper Data Type

In [10]:
# Reassign proper column types

# Change date data type to datetime
retail_sales["date"] = pd.to_datetime(retail_sales["date"], format="%Y-%m-%d")

# Change gender data type to category
retail_sales["gender"] = retail_sales["gender"].astype("category")

# Change product_category data type to category
retail_sales["product_category"] = retail_sales["product_category"].astype("category")

In [11]:
retail_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    1000 non-null   int64
 1   date              1000 non-null   datetime64[ns]
 2   customer_id       1000 non-null   object
 3   gender            1000 non-null   category
 4   age               1000 non-null   int64
 5   product_category  1000 non-null   category
 6   quantity          1000 non-null   int64
 7   price_per_unit    1000 non-null   int64
 8   total_amount      1000 non-null   int64
dtypes: category(2), datetime64[ns](1), int64(5), object(1)
memory usage: 57.0+ KB

# Export Cleaned Dataset

In [12]:
retail_sales.to_csv("../data/cleaned/retail_sales_cleaned.csv", index=False)